// tl.to(element, {x:100})
// .to(element, {x:200}, "+=3") // 타임라인 종료 3초 후 (갭)
// .to(element, {x:300}, "-=3") // 타임라인 종료 3초 전 (오버랩)
// .to(element, {x:400}, 5) // 타임라인 시작으로부터 5초 후 (절대적)
// .to(element, {y: -100}, "<") // 이전 트윈 타임라인 시작지점
// .to(element, {x: 150, y: -100}, ">") // 이전 트윈 타임라인 종료지점

let tl = gsap.timeline({
  defaults: {
    duration:2,ease:"power1.inOut",yoyo:true,repeat:-1
  }
})

  .to("#cr1", {x: 500})
  .to("#cr2", {x: 461.94, y: -191.64}, "<0.25")
  .to("#cr3", {x: 353.55, y: -353.56}, "<0.25")
  .to("#cr4", {x: 191.34, y: -461.94}, "<0.25")
  .to("#cr5", {y: -500}, "<0.25")
  .to("#cr6", {x: -191.35, y: -461.94}, "<0.25")
  .to("#cr7", {x: -353.55, y: -353.56}, "<0.25")
  .to("#cr8", {x: -461.94, y: -191.34}, "<0.25")